Tekla.Structures.Drawing.PickerInputObjectAndAPoint
The PickerInputObjectAndAPoint class represents a pick of an object in a view.
It provides both the picked object and the point used to pick the object.
Used for values asked by UI.Picker.PickObject(string Prompt, out DrawingObject PickedObject, out ViewBase PickedView, out Point PickedPoint).

Tekla.Structures.Drawing.PickerInputObjectAndAPoint.PickedPoint
Gets or sets the picked point in the view coordinates.

Tekla.Structures.Drawing.PickerInputObjectAndAPoint.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.PickerInputObjectAndAPoint.#ctor(Tekla.Structures.Drawing.DrawingObject,Tekla.Structures.Geometry3d.Point)
Creates a new PickerInputObjectAndAPoint instance representing the pick of a drawing object and
the coordinates of the point used to pick the object.
pickedObject: The picked drawing object.
pickedPoint: The picked point in the picked object view coordinates.